{
    "140": {
        "id": 140,
        "title": "Keynote",
        "description": "TBD",
        "language": "English"
    },
    "139": {
        "id": 139,
        "title": "Keynote",
        "description": "TBD",
        "language": "English"
    },
    "138": {
        "id": 138,
        "title": "Conference closing",
        "description": "Make sure you won't miss closing ceremony, all gifts from out sponsors and partners will find their owners during this session.",
        "image": "/images/backgrounds/closing.jpg"
    },
    "137": {
        "id": 137,
        "title": "Afterparty & Networking",
        "description": "Afterparty is a great time to have some fun and meet new people",
        "image": "/images/backgrounds/party.jpg"
    },
    "136": {
        "id": 136,
        "title": "GDG DevFest Belgium 2016 Opening",
        "description": "Official start of the conference. Greetings from the organizers, sponsors and partners.",
        "language": "English",
        "image": "/images/backgrounds/opening.jpg"
    },
    "135": {
        "id": 135,
        "title": "Morning coffee",
        "description": "Coffeeeeeee!",
        "image": "/images/backgrounds/morning.jpg"
    },
    "134": {
        "id": 134,
        "title": "Coffee break",
        "description": "Coffeeeeeee!",
        "image": "/images/backgrounds/coffee-break.jpg"
    },
    "133": {
        "id": 133,
        "title": "Lunch",
        "description": "Foooooooood!",
        "image": "/images/backgrounds/lunch.jpg"
    },
    "132": {
        "id": 132,
        "title": "Registration & morning Coffee",
        "description": "Get your badge, coffee, enjoy talking with tech edicts around",
        "image": "/images/backgrounds/registration.jpg"
    },
    "201": {
        "id": 201,
        "title": "Angular Workshop (4h)",
        "description": "It will be a workshop, we will give an application and teach how to upgrade it from Angular 1 to Angular 2!",
        "speakers": [
            [2]
        ],
        "language": "English",
        "complexity": "Beginner",
        "tags": [
            "Web"
        ]
    },
    "202": {
        "id": 202,
        "title": "Chrome for Work",
        "description": "Chrome for Work, experiences and opportunities with chromebooks",
        "speakers": [
          [11],[12]
        ],
        "language": "English",
        "complexity": "Beginner",
        "tags": [
            "Cloud"
        ]
    },
    "203": {
        "id": 203,
        "title": "My Minecraft-Smart-Home: Prototyping the Internet of Uncanny Things",
        "description": "Software solutions and everyday objects are becoming increasingly **smarter**, take over more **responsibility** and know more and more about us and our intentions.\n\nBut what does that mean for developers, and what impact does this have on the user? How do we convey the understanding and competence for this Internet of Things?\n\nSascha Wolter covers typical IoT challenges and inspires with crazy and sometimes creepy examples. He also introduces a prototypic approach for hardware and software ideation based on visual programming languages, games like Minecraft, and the Eclipse IDE. Of course, it is shown that this pragmatic approach is also suitable for professional projects using IoT platforms and smart home solutions such as Eclipse SmartHome, openHAB, or QIVICON.",
        "speakers": [
          [1]
        ],
        "language": "English",
        "complexity": "Beginner",
        "tags": [
            "IoT"
        ]
    },
    "204": {
      "id": 204,
      "title": "Angular 2 and Mobile",
      "description": "In this session, Joris will give an introduction how to build and develop mobile apps with Angular2.",
      "speakers": [
        [3]
      ],
      "language": "English",
      "complexity": "Beginner",
      "tags": [
          "Mobile Web"
      ]
    },
    "205": {
      "id": 205,
      "title": "Xamarin for Android Developers",
      "description": "Xamarin is a Cross-Platform Framework that allows developers to build mobile applications for iOS, Android and Windows using .NET and C#. From a single language mobile developers can leverage the power of C# and a single codebase to build and maintain their apps for all of the above three platforms. This talk gives an introduction of Xamarin and how Android developers can use it to develop apps not only for Android but easily add other platforms to it.",
      "speakers": [
        [4]
      ],
      "language": "English",
      "complexity": "Beginner",
      "tags": [
        "Android",
        "C#"
      ]
    },
    "206": {
      "id": 206,
      "title": "Dependency Injection with Toothpick",
      "description": "Dependency Injection (DI) is an important tool to create quality code. This is also true in Android. Toothpick is an alternative to Dagger 2. In this session you will learn about this new DI library.",
      "speakers": [
        [5]
      ],
      "language": "English",
      "complexity": "Intermediate",
      "tags": [
        "Android"
      ]
    },
    "207": {
      "id": 207,
      "title": "Tensorflow and deep learning - without a PhD",
      "description": "Google has recently open-sourced its framework for machine learning and neural networks called Tensorflow. With this new tool, deep machine learning transitions from an area of research into mainstream software engineering. In this session, we will teach you how to choose the right neural network for your problem and how to make it behave. Familiarity with differential equations is no longer required. Instead, a couple of lines ofTensorflow Python, and a bag of \"tricks of the trade\" will do the job. No previous Python knowledge required.",
      "speakers": [
        [7]
      ],
      "language": "English",
      "complexity": "Intermediate",
      "tags": [
        "AI",
        "Cloud"
      ]
    },
    "208": {
      "id": 208,
      "title": "Insights about Android Studio 2.2",
      "description": "To be productive it is important to know your tools. This sesssion gives you insights about IntelliJ and Android 2.2.",
      "speakers": [
        [6]
      ],
      "language": "English",
      "complexity": "Intermediate",
      "tags": [
        "Android"
      ]
    },
    "209": {
      "id": 209,
      "title": "View-based apps with Conductor",
      "description": "No more Activities or Fragments only Views! Conductor can save your from Android lifecycle hell! Architectural overkill or testing heaven, come and decide.",
      "speakers": [
        [9]
      ],
      "language": "English",
      "complexity": "Intermediate",
      "tags": [
        "Android"
      ]
    },
    "210": {
      "id": 210,
      "title": "The Progression of Web Apps",
      "description": "No, this title is not a typo. This talk is about Web Apps in general. We look at how we can create native apps using web technologies today. Of course we're going to look at the future too. Progressive Web Apps – what are they? And is the web now finally able to challenge native app development?",
      "speakers": [
        [10]
      ],
      "language": "English",
      "complexity": "Beginner",
      "tags": [
        "Mobile Web"
      ]
    },
    "211": {
      "id": 211,
      "title": "gRPC - high performance RPC framework",
      "description": "Introducing gRPC, the high performance open-source RPC framework. This session goes into detail about gRPC and what problems it solves.",
      "speakers": [
        [13]
      ],
      "language": "English",
      "complexity": "Beginner",
      "tags": [
        "Cloud"
      ]
    },
    "212": {
      "id": 212,
      "title": "Testing web applications with Protractor & Cucumber.js",
      "description": "Manually testing your application is time intensive and error prone. Using a DSL like Gherkin, that describes the behaviour of your users and business functionality, can come in handy when trying to cover every corner case.\n\nUsing Protractor in conjunction with CucumberJS can help you automate your E2E testing using these Gherkin scenarios. Especially when working with a continuous integration setup where you need to run the tests on every build, this can remove some weight from the shoulders of your testing team.\n\nSam will cover these concepts on a high level and go on with explaining some best practices, inviting you to go in-depth yourself with a starter kit to integrate in your environment or to play around.",
      "speakers": [
        [19]
      ],
      "language": "English",
      "complexity": "Intermediate",
      "tags": [
        "Web"
      ]
    },
    "213": {
      "id": 213,
      "title": "Reactive Mesh",
      "description": "Overview on some of the reactive frameworks for Android and Java (RxJava 1.x/2.x, Reactor, Akka, Agera). Examples, comparison and interoperability.",
      "speakers": [
        [18]
      ],
      "language": "English",
      "complexity": "Intermediate",
      "tags": [
        "Android",
        "Cloud"
      ]
    },
    "214": {
      "id": 214,
      "title": "Deploying and scaling with Kubernetes 1.4",
      "description": "Come to this talk to see how to deploy systems with Kubernetes, scale up and down a cluster, deploy and rollback versions of your applications, using the same tools in production at Box and Pokémon Go. If time permits we will also talk about new features in Kubernetes 1.3 and 1.4, such as autoscaling and Federated Services.",
      "speakers": [
        [8]
      ],
      "language": "English",
      "complexity": "Intermediate",
      "tags": [
        "Cloud"
      ]
    },
    "215": {
      "id": 215,
      "title": "Google BigQuery",
      "description": "Google BigQuery: SQL service for querying massive datasets. In this talk you will learn what BigQuery is and how/when you can use it.",
      "speakers": [
        [15]
      ],
      "language": "English",
      "complexity": "Intermediate",
      "tags": [
        "Cloud"
      ]
    },
    "216": {
      "id": 216,
      "title": "code lab: Big Data processing with Cloud DataFlow",
      "description": "During this codelab you will learn about the Dataflow programming model and build and deploy your first Dataflow pipelines using Java or Python.",
      "speakers": [
        [15], [22]
      ],
      "language": "English",
      "complexity": "Beginner",
      "tags": [
        "Cloud"
      ]
    },
    "217": {
      "id": 217,
      "title": "Are you botching the security of your AngularJS application?",
      "description": "If you make a list of popular JavaScript MVC frameworks, AngularJS is probably at the top of the list. Developers around the world are crazy about the Angular way of doing things, and love how easy it is to write AngularJS applications. However, few people know that AngularJS packs a lot security features, right out of the box. Unfortunately, because many developers are not aware of these security features, they are often unintentionally circumvented, or not used to their full potential. For example, think about common advice on Stack Overflow to turn off the protection against cross-site scripting (XSS) attacks, just so you can directly bind HTML data to a variable.\n\nIn this session, you will learn how to leverage AngularJS' security features to their full potential. Specifically, you will learn how AngularJS applies Strict Contextual Escaping (SCE) against XSS attacks, and how to relax that protection in a safe way (instead of turning it off). We also cover the advanced Content Security Policy (CSP), and AngularJS' built-in cross-site request forgery (CSRF) protection mechanism. We mainly focus on AngularJS 1.x, but also relate the concepts to AngularJS 2 where relevant.",
      "speakers": [
        [20]
      ],
      "language": "English",
      "complexity": "Intermediate",
      "tags": [
        "Web"
      ]
    },
    "218": {
      "id": 218,
      "title": "Creating Enterprise Apps with MADP",
      "description": "In a fragmented mobile landscape, developing mobile applications can be challenging, especially when creating enterprise mobile applications. Targeting the wrong audience, lack of security and a good integration can introduce surprises and pitfalls along your enterprise mobile journey. During this session, we will cover those enterprise mobility challenges by explaining and exploring MADP with its benefits, such as delivering fully native apps with 60-90% re-use of code across device platforms, decreasing test time by 90% and app project costs by 40% and the possibility of building fully reusable components in JavaScript.",
      "speakers": [
        [16]
      ],
      "language": "English",
      "complexity": "Beginner",
      "tags": [
        "Mobile Web"
      ]
    },
    "219": {
      "id": 219,
      "title": "Accessibility for everyone",
      "description": "Making apps for every user means that you should take care to make your app “accessible”.\n\nBut what does this mean for an Android developer?\n\nIn this talk I will go through some best practices and some case studies to make your apps accessible. And try to convince you that it’s not just a useful feature to have an app that can be used by visually impaired users, but that it also might be quite a bit easier than you might imagine.",
      "speakers": [
        [14]
      ],
      "language": "English",
      "complexity": "Beginner",
      "tags": [
        "Android"
      ]
    },
    "220": {
      "id": "220",
      "title": "Material Design Lite in Pharo",
      "description": "Showcase Material Design Lite integration in Pharo. Possible workshop to have attendees get Pharo running and livecode using MDL.",
      "speakers": [
        [17]
      ],
      "language": "English",
      "complexity": "Intermediate",
      "tags": [
        "Web"
      ]
    },
    "221": {
      "id": "221",
      "title": "code lab: Tensorflow and deep learning, without a PhD",
      "description": "Google has recently open-sourced its framework for machine learning and neural networks called Tensorflow. With this new tool, deep machine learning transitions from an area of research into mainstream software engineering. In this lab, you will learn how to choose the right neural network for your problem and how to make it behave. You will attack the problem of recognising handwritten digits and bring it, from the simplest solution all the way to 99% accuracy. Familiarity with differential equations is no longer required. Instead, a couple of lines of Tensorflow Python, and a bag of standard deep learning ingrediants will do the job (dense and convolutional networks, learning rate decay, dropout, relu activation function, ...). No previous Python knowledge required. Python beginners are invited to read a Python 1-pager before the lab: https://learnxinyminutes.com/docs/python3/\n\nPlease make sure that you followed the installation instructions beforehand: https://github.com/martin-gorner/tensorflow-mnist-tutorial/blob/master/INSTALL.txt",
      "speakers": [
        [7]
      ],
      "language": "English",
      "complexity": "Intermediate",
      "tags": [
        "AI",
        "Cloud"
      ]
    },
    "222": {
      "id": "222",
      "title": "code lab: Android",
      "description": "Dive into various parts of the Android platform.\n\nPlease make sure that you have Android Studio and the SDK installed.",
      "speakers": [

      ],
      "language": "English",
      "complexity": "Beginner/Intermediate",
      "tags": [
        "Android"
      ]
    },
    "223": {
      "id": "223",
      "title": "code lab: Progressive Web Apps",
      "description": "Progressive Web Apps are experiences that combine the best of the web and the best of apps. They are useful to users from the very first visit in a browser tab, no install required. As the user progressively builds a relationship with the app over time, it becomes more and more powerful. It loads quickly, even on flaky networks, sends relevant push notifications, has an icon on the home screen, and loads as a top-level, full screen experience.\n\nIn this codelab you will learn\n* How to design and construct an app using the 'app shell' method\n* How to make your app work offline\n* How to store data for use offline later\n\nhttps://codelabs.developers.google.com/codelabs/your-first-pwapp/index.html#0",
      "speakers": [
        [21]
      ],
      "language": "English",
      "complexity": "Beginner",
      "tags": [
        "Mobile Web"
      ]
    },
      "224": {
      "id": 224,
      "title": "AnimatedVectorDrawable explained",
      "description": "Let's have a look at how to animate VectorDrawable, what you can do with them and what tools exist to make your life easier.",
      "speakers": [
        [5]
      ],
      "language": "English",
      "complexity": "Intermediate",
      "tags": [
        "Android"
      ]
    },
}
